minisrv/Results/ab-classic.out
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /io
Document Length:        2 bytes

Concurrency Level:      200
Time taken for tests:   1.562 seconds
Complete requests:      3000
Failed requests:        0
Total transferred:      288000 bytes
HTML transferred:       6000 bytes
Requests per second:    1920.62 [#/sec] (mean)
Time per request:       104.133 [ms] (mean)
Time per request:       0.521 [ms] (mean, across all concurrent requests)
Transfer rate:          180.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:    53   96  13.4     96     153
Waiting:       52   86  12.1     86     139
Total:         53   96  13.4     96     154

Percentage of the requests served within a certain time (ms)
  50%     96
  66%    100
  75%    103
  80%    105
  90%    112
  95%    118
  98%    126
  99%    132
 100%    154 (longest request)